In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
lst = ['hesham','ali','maged']
s = pd.Series(lst)
s

0    hesham
1       ali
2     maged
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [4]:
s = pd.Series(lst, index =[ 11, 12, 13])
s

11    hesham
12       ali
13     maged
dtype: object

## Q3: Retrieve First and second elements.

In [5]:
s[0:2]

11    hesham
12       ali
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [6]:
s1 =  pd.Series({11: 'hesham'})
s2 = pd.concat((s,s1))
s2 = s2.drop_duplicates()
s2

11    hesham
12       ali
13     maged
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [7]:
 data = {
     
     'ID':[11],
     'Name': ['ali'],
     'GPA' : [4.50],
 }
students = pd.DataFrame(data)
students

   ID Name  GPA
0  11  ali  4.5

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [8]:
df = pd.read_csv("educ_figdp_1_Data.csv")
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [19]:
df.loc[0:5,['TIME','GEO']]

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)
4  2004  European Union (28 countries)
5  2005  European Union (28 countries)

In [25]:
df.iloc[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e